In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A   B   C   D   E
0  5  12  16   6  14
1  1  16   8  13  15
2  8   3  15   5  12
3  8   6  17  14  15
4  8   1  18  14   2

In [4]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

   A   B   C   D   E
0  5  12  16   6  14
2  8   3  15   5  12
3  8   6  17  14  15

In [5]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

   A   B   C   D   E
1  1  16   8  13  15
2  8   3  15   5  12
4  8   1  18  14   2

In [6]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A  B   C  D   E
0  8  3  15  5  12

In [7]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

   A   B   C   D   E
0  5  12  16   6  14
1  8   3  15   5  12
2  8   6  17  14  15
3  1  16   8  13  15
4  8   1  18  14   2